package b_vitaliy.test.task_1;
/*
Выбрать реализацию (интерфейсы/наследование),
написать приложение по продаже и обмену драгоценных камней.
Камни должны иметь стоимость.
Должен быть класс Client (заранее создаются 2 клиента
с разным набором денег и драгоценных камней),
так же класс биржа, на которой тоже есть определенный набор камней.
Пользователь может зайти под логином одного из Client,
и поучаствовать в торгах. Разные камни обмениваются/покупаются/продаются
по разному курсу.
 */

public class Main {
    public static void main(String[] args) {

    }
}
